import React, { Component } from 'react';
import { connect } from 'dva'
import {Link} from 'dva/router'
import './Mypage.css'
export default connect((state) => {
    return state
})(class Tabbar extends Component {

    // constructor(props) {
    //     console.log('-----------constructor-------------')
    //     super(props)
    //     this.state = {
    //     }

    // }
    getTitles() {
        this.props.dispatch({
            type: 'barTitle/getTitle',
            payload: {
                userName: 'zhoujunsen'
            }
        })
    }
    render() {
        console.log(this)
        return (

           <div>
  <div className="userCenter">
    <header id="head">
      <div className="userTop">
        <a id="t-goback" href="javascript:window.history.go(-1)">
          <span className="iconfont icon-fanhui" />
        </a>
        <span id="t-index">个人中心</span>
      </div>
      <div className="user-login">
        <Link to='reg'>注册</Link><i className="line" /><Link to='login'>登录</Link>
      </div>
    </header>
  </div>
  <div className="userBox">
    <a href="//m.juanpi.com/order" className="user-item-horizontal">
      <span>我的订单</span>
      <span className="iconfont icon-liebiaojiantou fr" />
      <span className="label fr">全部订单</span>
    </a>
    <div className="userItem">
      <a href="//m.juanpi.com/order/index/t/1">
        <em className="iconfont icon-daifukuan"><svg t="1561360340517" className="icon" viewBox="0 0 1040 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5884" width="200" height="200"><path d="M-0.2415 896.202359-0.2415 159.813822l63.984267 0 0 736.388537L-0.2415 896.202359-0.2415 896.202359zM768.114099 255.865435 768.114099 127.797641l64.033385 0 0 128.067794L768.114099 255.865435 768.114099 255.865435zM31.725562 896.202359l0-64.033385 864.455307 0 0 64.033385L31.725562 896.202359 31.725562 896.202359zM864.164688 896.202359 864.164688 672.083975l64.033385 0 0 224.11736L864.164688 896.201335 864.164688 896.202359zM864.164688 447.965591 864.164688 287.881616l64.033385 0L928.198074 447.965591 864.164688 447.965591 864.164688 447.965591zM768.114099 576.033385l0-64.034409 96.05059 0 0 64.034409L768.114099 576.033385 768.114099 576.033385zM672.061462 479.982796l0-64.033385 352.137059 0 0 64.033385L672.061462 479.982796 672.061462 479.982796zM672.061462 640.066771 672.061462 479.982796l64.034409 0 0 160.083975L672.061462 640.066771 672.061462 640.066771zM672.061462 672.083975l0-64.034409 352.137059 0 0 64.034409L672.061462 672.083975 672.061462 672.083975zM960.215278 640.066771 960.215278 479.982796l63.983243 0 0 160.083975L960.215278 640.066771 960.215278 640.066771zM-0.2415 191.831027l0-64.033385 832.388984 0 0 64.033385L-0.2415 191.831027-0.2415 191.831027zM63.742766 319.898821l0-64.033385 864.455307 0 0 64.033385L63.742766 319.898821 63.742766 319.898821z" p-id="5885"></path></svg></em><span className="text">待付款</span>					</a>
      <a href="//m.juanpi.com/order/index/t/13">
        <em className="iconfont icon-daichengtuan"><svg t="1561360646014" className="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="6835" width="200" height="200"><path d="M1024.001024 870.4a339.968 339.968 0 0 1-5.12 51.2h-102.4a209.408 209.408 0 0 0 5.12-51.2 204.8 204.8 0 0 0-198.656-204.8 383.488 383.488 0 0 1 45.056 179.2 379.392 379.392 0 0 1-7.68 76.8h-106.496a293.376 293.376 0 0 0 11.776-76.8 281.6 281.6 0 0 0-563.2 0 293.376 293.376 0 0 0 11.776 76.8H7.681024A379.392 379.392 0 0 1 0.001024 844.8a384.512 384.512 0 0 1 222.208-348.16 230.4 230.4 0 1 1 387.584-209.92 204.8 204.8 0 0 1 256 315.904A307.2 307.2 0 0 1 1024.001024 870.4zM384.001024 204.8A128 128 0 1 0 512.001024 332.8 128 128 0 0 0 384.001024 204.8zM716.801024 358.4a102.4 102.4 0 1 0 102.4 102.4 102.4 102.4 0 0 0-102.4-102.4z" fill="" p-id="6836"></path></svg></em><span className="text">待成团</span>					</a>
      <a href="//m.juanpi.com/order/index/t/14">
        <em className="iconfont icon-daishouhuo"><svg t="1561360724426" className="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="7789" width="200" height="200"><path d="M949.711552 538.055422l-55.942103-36.121685-92.848665-113.834628c-2.950192-3.523243-8.196683-9.057283-12.791327-9.057283L650.510122 379.041826l0-108.316961c0-8.55791-3.26537-15.542998-11.824303-15.542998L383.816061 255.181867c-22.090111-61.930491-83.641979-112.051005-156.079778-112.051005-90.944292 0-163.895791 73.995271-163.895791 164.939563 0 57.667398 29.30135 108.438735 75.748195 137.921209l0 310.443471 0 74.720795c0 8.55791 4.868891 12.367679 13.426801 12.367679l124.343983 0c12.171204 30.934546 35.455513 37.34556 62.45954 37.34556 26.988678 0 50.256614-6.411013 62.428841-37.34556l304.749796 0c12.172227 30.934546 35.455513 37.34556 62.45954 37.34556s50.257637-6.411013 62.427818-37.34556l105.686041 0c8.55791 0 22.588461-3.809769 22.588461-12.367679l0-74.720795L960.159508 550.921451C960.158485 545.766035 954.020694 540.912493 949.711552 538.055422zM780.870122 410.007071l88.767719 110.010533c0.953721 1.133823 5.624091 3.870144 6.865361 4.702092l52.690036 34.487465 0 175.940105L650.510122 735.147266 650.510122 438.870446l0-28.863375L780.870122 410.007071zM93.776292 308.086797c0-73.844845 60.099796-133.945665 133.958968-133.945665 73.859171 0 133.959991 60.099796 133.959991 133.945665 0 73.859171-60.10082 133.974317-133.959991 133.974317C153.877111 442.060091 93.776292 381.944945 93.776292 308.086797zM228.763682 473.011011c90.944292 0 164.410514-74.010621 164.410514-164.954913 0-7.423063-1.178849-21.907962-2.146896-21.907962l228.517577 0 0 115.362424 0 37.360909 0 296.275797L170.552909 735.147266 170.552909 461.83753C186.035532 468.943368 207.868793 473.011011 228.763682 473.011011zM170.552909 812.559357l0-46.447868 110.448508 0c-7.982812 15.482623-12.715603 26.821879-12.715603 41.880853 0 1.088798 0.272199 4.567016 0.272199 4.567016L170.552909 812.559357zM339.817987 853.018837c-22.36231 0-40.565904-18.203594-40.565904-40.550555 0-22.376637 18.203594-40.551578 40.565904-40.551578 22.36231 0 40.550555 18.174941 40.550555 40.551578C380.368542 834.815243 362.179274 853.018837 339.817987 853.018837zM411.00019 812.559357c0 0 0.332575-3.477194 0.332575-4.567016 0-15.058974-4.748141-26.39823-12.729929-41.880853l240.084007 0 71.952752 0c-7.982812 15.482623-12.715603 26.821879-12.715603 41.880853 0 1.088798 0.272199 4.567016 0.272199 4.567016L411.00019 812.559357zM769.456165 853.018837c-22.363334 0-40.566928-18.203594-40.566928-40.550555 0-22.376637 18.203594-40.551578 40.566928-40.551578 22.361287 0 40.550555 18.174941 40.550555 40.551578C810.006719 834.815243 791.816428 853.018837 769.456165 853.018837zM840.63939 812.559357c0 0 0.331551-3.477194 0.331551-4.567016 0-15.058974-4.747117-26.39823-12.730952-41.880853l100.95325 0 0 46.447868L840.63939 812.559357zM227.735259 317.112358l-74.720795 0c-8.55791 0-15.482623-6.940063-15.482623-15.482623 0-8.556886 6.924713-15.482623 15.482623-15.482623l63.986313 0 0-52.766784c0-8.556886 6.924713-15.482623 15.482623-15.482623s15.482623 6.925736 15.482623 15.482623l0 74.706469C247.966023 316.659033 236.293169 317.112358 227.735259 317.112358z" p-id="7790"></path></svg></em><span className="text">待收货</span>					</a>
      <a href="//m.juanpi.com/refund/backlist">
        <em className="iconfont icon-tuikuanshouhou"><svg t="1561360774046" class="icon" viewBox="0 0 1086 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="8558" width="200" height="200"><path d="M573.282424 1023.999592A510.164797 510.164797 0 0 1 210.433254 873.102648a21.612631 21.612631 0 0 1 30.651134-30.478243 468.300435 468.300435 0 1 0-129.668378-409.023462 21.611396 21.611396 0 1 1-42.617673-7.212032 511.980155 511.980155 0 1 1 504.484087 597.610681z" fill="" p-id="8559"></path><path d="M565.613466 490.790872L387.053934 275.03504a21.626216 21.626216 0 0 1 33.343297-27.551443l145.216235 175.509237 150.477065-181.832114a21.626216 21.626216 0 0 1 33.343297 27.551443z" fill="" p-id="8560"></path><path d="M712.719153 482.20806H413.283995a21.611396 21.611396 0 0 1 0-43.222792h299.435158a21.611396 21.611396 0 0 1 0 43.222792zM709.224282 610.974935H409.801473a21.611396 21.611396 0 0 1 0-43.222793H709.224282a21.611396 21.611396 0 1 1 0 43.222793z" fill="" p-id="8561"></path><path d="M559.512877 817.444041a21.611396 21.611396 0 0 1-21.611396-21.611397V439.652134a21.611396 21.611396 0 0 1 43.222793 0v356.229908a21.611396 21.611396 0 0 1-21.611397 21.561999z" fill="" p-id="8562"></path><path d="M559.512877 817.444041a21.611396 21.611396 0 0 1-21.611396-21.611397V439.652134a21.611396 21.611396 0 0 1 43.222793 0v356.229908a21.611396 21.611396 0 0 1-21.611397 21.561999zM0 413.496169l57.424567 227.833515 137.078-196.354972z" fill="" p-id="8563"></path></svg></em><span className="text">退款/售后</span>
      </a>
    </div>
    <div id="banner_block" />
    <div id="module-ad" />
    <div className="userItems">
      <a href="//m.juanpi.com/coupon" className="user-item-horizontal">
        <span>我的优惠券</span>
        <span className="iconfont icon-liebiaojiantou fr" />
      </a>
      <a href="//m.juanpi.com/myfavorite" className="user-item-horizontal">
        <span>
          我的收藏
        </span>
        <span className="iconfont icon-liebiaojiantou fr">
          <i className="sc_circle" />
        </span>
      </a>
      <a href="https://tuan.juanpi.com/pintuan/my" className="user-item-horizontal">
        <span>我的拼团</span>
        <span className="iconfont icon-liebiaojiantou fr" />
      </a>
      {/*<a href="https://m.juanpi.com/pay/card_confirm?pf=2" class="user-item-horizontal" onclick="_paq.push(['trackEvent','center','click_center_item', 'item','vip'])">
              <span>至尊会员卡</span>
              <span class="iconfont icon-liebiaojiantou fr"></span>
              <span class="label fr">办理即享9折</span>
          </a>*/}
      <a href="https://mact.juanpi.com/couponlist_leaderfree" className="user-item-horizontal">
        <span>我的免单券</span>
        <span className="iconfont icon-liebiaojiantou fr" />
        <span className="label fr">0张</span>
      </a>
      <a href="https://m.juanpi.com/jieqian?imageProtocol=0" className="user-item-horizontal">
        <span>借钱</span>
        <span className="iconfont icon-liebiaojiantou fr" />
        <span className="label fr">新用户免费领1000元</span>
      </a>
    </div>
    <div className="userItems">
      <a href="//m.juanpi.com/service/index" className="user-item-horizontal">
        <span>客服中心</span>
        <span className="iconfont icon-liebiaojiantou fr" />
      </a>
      <a href="//m.juanpi.com/about/juanpi" className="user-item-horizontal no-bottom">
        <span>关于卷皮</span>
        <span className="iconfont icon-liebiaojiantou fr" />
      </a>
    </div>
    <input type="hidden" id="isBoxShow" name="isBoxShow" defaultValue={0} />
    <input type="hidden" id="fromLoginUrl" name="fromLoginUrl" defaultValue />
  </div>
</div>

        )
    }


})